varunmarolia/Tarang/arch/cpu/efr32/serial-arch.c
#include "serial-arch.h"
#include "serial-dev.h"
#include <stdbool.h>
#define RX_NVIC 0
#define TX_NVIC 1

#define DEBUG_SERIAL_ARCH 0     /**< Set this to 1 for debug printf output */
#if DEBUG_SERIAL_ARCH
#include <stdio.h>
#define PRINTF(...) printf(__VA_ARGS__)
#else
#define PRINTF(...)      /**< Replace printf with nothing */
#endif /* DEBUG_SERIAL_ARCH */

#pragma GCC diagnostic ignored "-Wattributes" /* for GCC V12 it gives warning of FP regsiters might be clobbered */

#ifdef USART0
void USART0_RX_IRQHandler() __attribute__((interrupt));
void USART0_TX_IRQHandler() __attribute__((interrupt));
static serial_dev_t *dev_on_uart0 = NULL;
#endif  /* USART0 */
#ifdef USART1
void USART1_RX_IRQHandler() __attribute__((interrupt));
void USART1_TX_IRQHandler() __attribute__((interrupt));
static serial_dev_t *dev_on_uart1 = NULL;
#endif  /* USART1 */
#ifdef USART2
void USART2_RX_IRQHandler() __attribute__((interrupt));
void USART2_TX_IRQHandler() __attribute__((interrupt));
static serial_dev_t *dev_on_uart2 = NULL;
#endif  /* USART2 */
/*---------------------------------------------------------------------------*/
static serial_bus_status_t
serial_init_I2C(serial_dev_t *dev)
{
  serial_bus_config_t *bus_config = &dev->bus->config;
  uint32_t scl_port = 0, scl_pin = 0;
  uint32_t sda_port = 0, sda_pin = 0;
  I2C_Init_TypeDef i2cInit = I2C_INIT_DEFAULT;
  /* check if the speed is configured correctly. Usual speed are 100KHz or 400KHz */
  if(dev->speed_hz != I2C_SPEED_NORMAL_HZ &&
    dev->speed_hz != I2C_SPEED_FAST_HZ) {
    PRINTF("I2C (%s): speed %lu is invalid\n", __func__, dev->speed);
    return BUS_INVALID;
  }
  /* Check if the I2C bus is supported by the hardware
  * enable required clocks (GPIO for pins routing) for given I2C bus
  * Decode port and pin number using pin locations.
  * */
  if(bus_config->I2Cx == I2C0) {
    CMU_ClockEnable(cmuClock_I2C0, true);
    /* unlock I2C peripherals and grant access
    * to their registers for updating their configurations after a deep sleep.
    */
    EMU->EM23PERNORETAINCMD = EMU_EM23PERNORETAINCMD_I2C0UNLOCK;
    /* for I2C data out and data in location must be same */
    sda_port = AF_I2C0_SDA_PORT(bus_config->data_out_loc);
    sda_pin = AF_I2C0_SDA_PIN(bus_config->data_out_loc);

    scl_port = AF_I2C0_SCL_PORT(bus_config->clk_loc);
    scl_pin = AF_I2C0_SCL_PIN(bus_config->clk_loc);

  #ifdef I2C1
  } else if(bus_config->I2Cx == I2C1) {
    CMU_ClockEnable(cmuClock_I2C1, true);
    /* unlock I2C peripherals and grant access
    * to their registers for updating their configurations after a deep sleep.
    */
    EMU->EM23PERNORETAINCMD = EMU_EM23PERNORETAINCMD_I2C1UNLOCK;

    sda_port = AF_I2C1_SDA_PORT(bus_config->data_out_loc);
    sda_pin = AF_I2C1_SDA_PIN(bus_config->data_out_loc);

    scl_port = AF_I2C1_SCL_PORT(bus_config->clk_loc);
    scl_pin = AF_I2C1_SCL_PIN(bus_config->clk_loc);
  #endif /* I2C1 */
  } else {
    PRINTF("I2C (%s): unsupported I2Cx: %p\n", __func__, conf->I2Cx);
    return BUS_INVALID;
  }
  PRINTF("I2C: SDA PORT: %d, PIN: %d\n", (int)sda_port, (int)sda_pin);
  PRINTF("I2C: SCL PORT: %d, PIN: %d\n", (int)scl_port, (int)scl_pin);
  /* enable GPIO clock  */
  CMU_ClockEnable(cmuClock_GPIO, true);
  /* Set the GPIO pin mode Open-drain output with filter */
  GPIO_PinModeSet(sda_port, sda_pin, gpioModeWiredAndFilter, 1);
  GPIO_PinModeSet(scl_port, scl_pin, gpioModeWiredAndFilter, 1);
  /* Route the given I2C bus pins to given pin location  */
  bus_config->I2Cx->ROUTEPEN = I2C_ROUTEPEN_SDAPEN | I2C_ROUTEPEN_SCLPEN;
  bus_config->I2Cx->ROUTELOC0 = (bus_config->data_out_loc << _I2C_ROUTELOC0_SDALOC_SHIFT) |
                          (bus_config->clk_loc << _I2C_ROUTELOC0_SCLLOC_SHIFT);
  i2cInit.enable = true; /* enable the bus */
  i2cInit.master = true; /* master mode only */
  /* initialize I2C controller */
  I2C_Init(bus_config->I2Cx, &i2cInit);
  /* Set bus frequency */
  I2C_BusFreqSet(bus_config->I2Cx, 0, dev->speed_hz, i2cClockHLRStandard);
  /* setup auto acknowledge and auto STOP on NACK */
  bus_config->I2Cx->CTRL |= I2C_CTRL_AUTOACK | I2C_CTRL_AUTOSN;
  /* setup the i2c bus timeout for this device */
  serial_arch_restart_timer(dev);
  /* lock the device by setting the flag and pairing the device pointer */
  dev->bus->lock = 1;
  dev->bus->current_dev = dev;
  return BUS_OK;
}
/*---------------------------------------------------------------------------*/
static serial_bus_status_t
serial_init_SPI(serial_dev_t *dev)
{
  USART_TypeDef* spi_uart = dev->bus->config.SPI_UART_USARTx;
  serial_bus_config_t* bus_config = &(dev->bus->config);

  /* enable all required clocks */
  if(spi_uart == USART0) {
    CMU_ClockEnable(cmuClock_USART0, true);
  } else if(spi_uart == USART1) {
    CMU_ClockEnable(cmuClock_USART1, true);
  } else if(spi_uart == USART2) {
    CMU_ClockEnable(cmuClock_USART2, true);
  } else {
    PRINTF("SPI (%s): interface not supported!\n", __func__);
    return BUS_INVALID;
  }
  CMU_ClockEnable(cmuClock_GPIO, true);

  USART_InitSync_TypeDef spi_init = USART_INITSYNC_DEFAULT;

  /* configure SPI controller */
  spi_init.master = true;
  spi_init.msbf     = bus_config->msb_first; 
  spi_init.baudrate = dev->speed_hz;
  spi_init.clockMode = bus_config->clock_mode;
  USART_InitSync(spi_uart, &spi_init);

  /* IO config */
  if(spi_uart == USART0) {
    GPIO_PinModeSet(AF_USART0_TX_PORT(bus_config->data_out_loc), AF_USART0_TX_PIN(bus_config->data_out_loc), gpioModePushPull, 1);
    GPIO_PinModeSet(AF_USART0_RX_PORT(bus_config->data_in_loc), AF_USART0_RX_PIN(bus_config->data_in_loc), gpioModeInput, 0);
    GPIO_PinModeSet(AF_USART0_CLK_PORT(bus_config->clk_loc), AF_USART0_CLK_PIN(bus_config->clk_loc), gpioModePushPull, 1);
  } else if(spi_uart == USART1) {
    GPIO_PinModeSet(AF_USART1_TX_PORT(bus_config->data_out_loc), AF_USART1_TX_PIN(bus_config->data_out_loc), gpioModePushPull, 1);
    GPIO_PinModeSet(AF_USART1_RX_PORT(bus_config->data_in_loc), AF_USART1_RX_PIN(bus_config->data_in_loc), gpioModeInput, 0);
    GPIO_PinModeSet(AF_USART1_CLK_PORT(bus_config->clk_loc), AF_USART1_CLK_PIN(bus_config->clk_loc), gpioModePushPull, 1);
  } else if(spi_uart == USART2) {
    GPIO_PinModeSet(AF_USART2_TX_PORT(bus_config->data_out_loc), AF_USART2_TX_PIN(bus_config->data_out_loc), gpioModePushPull, 1);
    GPIO_PinModeSet(AF_USART2_RX_PORT(bus_config->data_in_loc), AF_USART2_RX_PIN(bus_config->data_in_loc), gpioModeInput, 0);
    GPIO_PinModeSet(AF_USART2_CLK_PORT(bus_config->clk_loc), AF_USART2_CLK_PIN(bus_config->clk_loc), gpioModePushPull, 1);
  } else {
    PRINTF("SPI (%s): controller not supported!\n", __func__);
    return BUS_INVALID;
  }

