varunmarolia/Tarang/arch/cpu/efr32/serial-arch.c
  /* enable routing in USART controller */
  spi_uart->ROUTELOC0 = ((bus_config->data_out_loc << _USART_ROUTELOC0_TXLOC_SHIFT) |
                       (bus_config->data_in_loc << _USART_ROUTELOC0_RXLOC_SHIFT) |
                       (bus_config->clk_loc << _USART_ROUTELOC0_CLKLOC_SHIFT));
  spi_uart->ROUTEPEN = (USART_ROUTEPEN_RXPEN | USART_ROUTEPEN_TXPEN | USART_ROUTEPEN_CLKPEN);

  /* setup the bus timeout for this device */
  serial_arch_restart_timer(dev);
  /* lock the device by setting the flag and pairing the device pointer */
  dev->bus->lock = 1;
  dev->bus->current_dev = dev;
  return BUS_OK;
}
/*---------------------------------------------------------------------------*/
static void
serial_uart_NVIC_interrupt(USART_TypeDef *uart, uint8_t rxtx, bool enable)
{
  if(rxtx == RX_NVIC) {
    if(enable) {
      if(uart == USART0) {
        NVIC_EnableIRQ(USART0_RX_IRQn);
      } else if(uart == USART1) {
        NVIC_EnableIRQ(USART1_RX_IRQn);
      } else if(uart == USART2) {
        NVIC_EnableIRQ(USART2_RX_IRQn);
      }
    } else {
      if(uart == USART0) {
        NVIC_DisableIRQ(USART0_RX_IRQn);
      } else if(uart == USART1) {
        NVIC_DisableIRQ(USART1_RX_IRQn);
      } else if(uart == USART2) {
        NVIC_DisableIRQ(USART2_RX_IRQn);
      }
    }
  } else {
    if(enable) {
      if(uart == USART0) {
        NVIC_EnableIRQ(USART0_TX_IRQn);
      } else if(uart == USART1) {
        NVIC_EnableIRQ(USART1_TX_IRQn);
      } else if(uart == USART2) {
        NVIC_EnableIRQ(USART2_TX_IRQn);
      }
    } else {
      if(uart == USART0) {
        NVIC_DisableIRQ(USART0_TX_IRQn);
      } else if(uart == USART1) {
        NVIC_DisableIRQ(USART1_TX_IRQn);
      } else if(uart == USART2) {
        NVIC_DisableIRQ(USART2_TX_IRQn);
      }
    }
  }
}
/*---------------------------------------------------------------------------*/
static void
serial_uart_NVIC_clear_interrupt(USART_TypeDef *uart, uint8_t rxtx)
{
  if(rxtx == RX_NVIC) {
    if(uart == USART0) {
      NVIC_ClearPendingIRQ(USART0_RX_IRQn);
    } else if(uart == USART1) {
      NVIC_ClearPendingIRQ(USART1_RX_IRQn);
    } else if(uart == USART2) {
      NVIC_ClearPendingIRQ(USART2_RX_IRQn);
    }
  } else {
    if(uart == USART0) {
      NVIC_ClearPendingIRQ(USART0_TX_IRQn);
    } else if(uart == USART1) {
      NVIC_ClearPendingIRQ(USART1_TX_IRQn);
    } else if(uart == USART2) {
      NVIC_ClearPendingIRQ(USART2_TX_IRQn);
    }
  }
}
/*---------------------------------------------------------------------------*/
static void
uart_rx_interrupt_handler(USART_TypeDef *uart)
{
  uint8_t data;
  uint32_t interrupt_flags = USART_IntGetEnabled(uart);
  /* clear interrupt flags */
  USART_IntClear(uart, interrupt_flags & (USART_IF_FERR | USART_IF_PERR | USART_IF_RXOF));
  if(interrupt_flags & USART_IF_RXDATAV) {
    if(uart->STATUS & USART_STATUS_RXDATAV) {
      data = USART_RxDataGet(uart);
#ifdef USART0
      if(uart == USART0) {
        if(dev_on_uart0->bus->config.input_handler != NULL) {
          dev_on_uart0->bus->config.input_handler(data);
        }
      }
#endif  /* USART0 */
#ifdef USART1
      if(uart == USART1) {
        if(dev_on_uart1->bus->config.input_handler != NULL) {
          dev_on_uart1->bus->config.input_handler(data);
        }
      }
#endif  /* USART1 */
#ifdef USART2
      if(uart == USART2) {
        if(dev_on_uart2->bus->config.input_handler != NULL) {
          dev_on_uart2->bus->config.input_handler(data);
        }
      }
#endif  /* USART2 */
      /* clear RXDATAV interrupt flag */
      USART_IntClear(uart, USART_IF_RXDATAV);
    }
  }
}
/*---------------------------------------------------------------------------*/
static void
uart_tx_interrupt_handler(USART_TypeDef *uart)
{

}
/*---------------------------------------------------------------------------*/
#ifdef USART0
void
USART0_TX_IRQHandler()
{
  uart_tx_interrupt_handler(USART0);
}
/*---------------------------------------------------------------------------*/
void
USART0_RX_IRQHandler()
{
  uart_rx_interrupt_handler(USART0);
}
#endif  /* USART0 */
/*---------------------------------------------------------------------------*/
#ifdef USART1
void
USART1_TX_IRQHandler()
{
  uart_tx_interrupt_handler(USART1);
}
/*---------------------------------------------------------------------------*/
void
USART1_RX_IRQHandler()
{
  uart_rx_interrupt_handler(USART1);
}
#endif  /* USART1 */
/*---------------------------------------------------------------------------*/
#ifdef USART2
void
USART2_TX_IRQHandler()
{
  uart_tx_interrupt_handler(USART2);
}
/*---------------------------------------------------------------------------*/
void
USART2_RX_IRQHandler()
{
  uart_rx_interrupt_handler(USART2);
}
#endif  /* USART2 */
/*---------------------------------------------------------------------------*/
static serial_bus_status_t
serial_init_UART(serial_dev_t *dev)
{
  serial_bus_config_t *bus_config = &dev->bus->config;
  USART_InitAsync_TypeDef uart_init  = USART_INITASYNC_DEFAULT;
  CMU_ClockEnable(cmuClock_HFPER, true);
  CMU_ClockEnable(cmuClock_GPIO, true);
  GPIO_Port_TypeDef tx_port, rts_port = 0;
  GPIO_Port_TypeDef rx_port, cts_port = 0;
  uint8_t tx_pin = 0, rts_pin = 0;
  uint8_t rx_pin = 0, cts_pin = 0;
  /* if special baud rate is defined load that. default is 115200 */
  if(dev->speed_hz != 0) {
    uart_init.baudrate = dev->speed_hz;
  } else {
    uart_init.baudrate = SERIAL_UART_DEFAUT_BAUDRATE;
  }
  uart_init.parity = bus_config->parity_mode;
  uart_init.stopbits = bus_config->stop_bits;

  if(bus_config->SPI_UART_USARTx == USART0) {
    CMU_ClockEnable(cmuClock_USART0, true);
    tx_port = AF_USART0_TX_PORT(bus_config->data_out_loc);
    tx_pin = AF_USART0_TX_PIN(bus_config->data_out_loc);
    rx_port = AF_USART0_RX_PORT(bus_config->data_in_loc);
    rx_pin = AF_USART0_RX_PIN(bus_config->data_in_loc);
    if(bus_config->uart_mode == UART_MODE_TX_RX_FLOW) {
      rts_port = AF_USART0_RTS_PORT(bus_config->rts_loc);
      rts_pin = AF_USART0_RTS_PIN(bus_config->rts_loc);
      cts_port = AF_USART0_CTS_PORT(bus_config->cts_loc);
      cts_pin = AF_USART0_CTS_PIN(bus_config->cts_loc);
    }
    dev_on_uart0 = dev;
  }
  else if(bus_config->SPI_UART_USARTx == USART1) {
    CMU_ClockEnable(cmuClock_USART1, true);
    tx_port = AF_USART1_TX_PORT(bus_config->data_out_loc);
    tx_pin = AF_USART1_TX_PIN(bus_config->data_out_loc);
    rx_port = AF_USART1_RX_PORT(bus_config->data_in_loc);
    rx_pin = AF_USART1_RX_PIN(bus_config->data_in_loc);
    if(bus_config->uart_mode == UART_MODE_TX_RX_FLOW) {
      rts_port = AF_USART1_RTS_PORT(bus_config->rts_loc);
      rts_pin = AF_USART1_RTS_PIN(bus_config->rts_loc);
      cts_port = AF_USART1_CTS_PORT(bus_config->cts_loc);
      cts_pin = AF_USART1_CTS_PIN(bus_config->cts_loc);
    }
    dev_on_uart1 = dev;
  }
  else if(bus_config->SPI_UART_USARTx == USART2) {
    CMU_ClockEnable(cmuClock_USART2, true);
    tx_port = AF_USART2_TX_PORT(bus_config->data_out_loc);
    tx_pin = AF_USART2_TX_PIN(bus_config->data_out_loc);
    rx_port = AF_USART2_RX_PORT(bus_config->data_in_loc);
    rx_pin = AF_USART2_RX_PIN(bus_config->data_in_loc);
    if(bus_config->uart_mode == UART_MODE_TX_RX_FLOW) {
      rts_port = AF_USART2_RTS_PORT(bus_config->rts_loc);
      rts_pin = AF_USART2_RTS_PIN(bus_config->rts_loc);
      cts_port = AF_USART2_CTS_PORT(bus_config->cts_loc);
      cts_pin = AF_USART2_CTS_PIN(bus_config->cts_loc);
    }
    dev_on_uart2 = dev;
  }
  else {
    PRINTF("UART (%s): interface not supported!\n", __func__);
    return BUS_INVALID;
  }
  /* Configure GPIO pin, To avoid false start, configure TX pin as initial high */
  GPIO_PinModeSet(tx_port, tx_pin, gpioModePushPull, 1);
  if(bus_config->uart_mode != UART_MODE_TX_ONLY) {
    GPIO_PinModeSet(rx_port, rx_pin, gpioModeInput, 0);
  }
  /* set RTS and CTS pin mode if they are defined */
  if(bus_config->uart_mode == UART_MODE_TX_RX_FLOW) {
    uart_init.hwFlowControl = usartHwFlowControlCtsAndRts;
    GPIO_PinModeSet(rts_port, rts_pin, gpioModePushPull, 1);
    GPIO_PinModeSet(cts_port, cts_pin, gpioModeInput, 0);
  }

